# FormattedText Properties

---
The FormattedText type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FormattedText Class
Autodesk.Revit.DB Namespace